#include <iostream>
#include <stdexcept>
#include <string> 
#include "definitions.h"
#include <vector>
#include <variant>
using namespace std;
using संयोगः = std::vector<std::variant<wire,char>>;

संयोगः वा (संयोगः प्रथमतार्किकाङ्गम्, संयोगः द्वितीयतार्किकाङ्गम्) {
    bool अक्षरत्वपरीक्षा = false;
    संयोगः तृतीयतार्किकाङ्गम् ;
    wire अस्थायी;
    int प;
    अस्थायी.setVal(z);
    if (प्रथमतार्किकाङ्गम्.length() >द्वितीयतार्किकाङ्गम्.length() ) {
        प = प्रथमतार्किकाङ्गम्.length() - द्वितीयतार्किकाङ्गम्.length();
        while (प >0) {
            द्वितीयतार्किकाङ्गम्.push(अस्थायी);
            प--;
        }
    } else if (द्वितीयतार्किकाङ्गम्.length() > प्रथमतार्किकाङ्गम्.length() ) {
        प = द्वितीयतार्किकाङ्गम्.length() - प्रथमतार्किकाङ्गम्.length();
        while (प >0) {
            प्रथमतार्किकाङ्गम्.push(अस्थायी);
            प--;
        }
    }
    for (प=0; प < द्वितीयतार्किकाङ्गम्.length(); प++) {
        अक्षरत्वपरीक्षा = true;
        if(wire wire_प्रथमास्थायी = std::get_if<wire> wire_प्रथमास्थायी ) {
            अक्षरत्वपरीक्षा = false;
            प्रथमास्थायी = wire_प्रथमास्थायी.getVal();
        }else if (char प्रथमास्थायी = std::get_if<char> प्रथमास्थायी ) {
        }
        if(wire wire_द्वितीयास्थायी = std::get_if<wire> wire_द्वितीयास्थायी ) {
            अक्षरत्वपरीक्षा = false;
            द्वितीयास्थायी = wire_द्वितीयास्थायी.getVal();
        }else if (char द्वितीयास्थायी = std::get_if<char> द्वितीयास्थायी ) {
            
        }

        if (प्रथमास्थायी == 'z' || द्वितीयास्थायी == 'z') {
            अस्थायी.setVal(z);            
        } else if (प्रथमास्थायी == '1' && द्वितीयास्थायी == '1') {
            अस्थायी.setVal('1');
        } else if (प्रथमास्थायी == '0' || द्वितीयास्थायी == '0') {
            अस्थायी.setVal('0');
        } else {
            अस्थायी.setVal('x');
        }
        if (!अक्षरत्वपरीक्षा) {
            तृतीयतार्किकाङ्गम्.push_back(अक्षरत्वपरीक्षा);
        } else {
            तृतीयतार्किकाङ्गम्.push_back(अस्थायी.getVal());
        }
    }
}

संयोगः च (संयोगः प्रथमतार्किकाङ्गम्, संयोगः द्वितीयतार्किकाङ्गम्) {
    bool अक्षरत्वपरीक्षा = false;
    संयोगः तृतीयतार्किकाङ्गम् ;
    wire अस्थायी;
    int प;
    अस्थायी.setVal(z);
    if (प्रथमतार्किकाङ्गम्.length() >द्वितीयतार्किकाङ्गम्.length() ) {
        प = प्रथमतार्किकाङ्गम्.length() - द्वितीयतार्किकाङ्गम्.length();
        while (प >0) {
            द्वितीयतार्किकाङ्गम्.push(अस्थायी);
            प--;
        }
    } else if (द्वितीयतार्किकाङ्गम्.length() > प्रथमतार्किकाङ्गम्.length() ) {
        प = द्वितीयतार्किकाङ्गम्.length() - प्रथमतार्किकाङ्गम्.length();
        while (प >0) {
            प्रथमतार्किकाङ्गम्.push(अस्थायी);
            प--;
        }
    }
    for (प=0; प < द्वितीयतार्किकाङ्गम्.length(); प++) {
        अक्षरत्वपरीक्षा = true;
        if(wire wire_प्रथमास्थायी = std::get_if<wire> wire_प्रथमास्थायी ) {
            अक्षरत्वपरीक्षा = false;
            प्रथमास्थायी = wire_प्रथमास्थायी.getVal();
        }else if (char प्रथमास्थायी = std::get_if<char> प्रथमास्थायी ) {
        }
        if(wire wire_द्वितीयास्थायी = std::get_if<wire> wire_द्वितीयास्थायी ) {
            अक्षरत्वपरीक्षा = false;
            द्वितीयास्थायी = wire_द्वितीयास्थायी.getVal();
        }else if (char द्वितीयास्थायी = std::get_if<char> द्वितीयास्थायी ) {
            
        }

        if (प्रथमास्थायी == 'z' || द्वितीयास्थायी == 'z') {
            अस्थायी.setVal(z);            
        } else if (प्रथमास्थायी == '1' || द्वितीयास्थायी == '1') {
            अस्थायी.setVal('1');
        } else if (प्रथमास्थायी == '0' && द्वितीयास्थायी == '0') {
            अस्थायी.setVal('0');
        } else {
            अस्थायी.setVal('x');
        }
        if (!अक्षरत्वपरीक्षा) {
            तृतीयतार्किकाङ्गम्.push_back(अक्षरत्वपरीक्षा);
        } else {
            तृतीयतार्किकाङ्गम्.push_back(अस्थायी.getVal());
        }
    }
    return तृतीयतार्किकाङ्गम्;
}

संयोगः न (संयोगः प्रथमतार्किकाङ्गम्) {
    bool अक्षरत्वपरीक्षा = false;
    संयोगः तृतीयतार्किकाङ्गम् ;
    wire अस्थायी;
    int प;    
    for (प=0; प < द्वितीयतार्किकाङ्गम्.length(); प++) {
        अक्षरत्वपरीक्षा = true;
        if(wire wire_प्रथमास्थायी = std::get_if<wire> wire_प्रथमास्थायी ) {
            अक्षरत्वपरीक्षा = false;
            प्रथमास्थायी = wire_प्रथमास्थायी.getVal();
        }else if (char प्रथमास्थायी = std::get_if<char> प्रथमास्थायी ) {
        }        
        if (प्रथमास्थायी == 'z') {
            अस्थायी.setVal('z');
        } else if (प्रथमास्थायी == '0') {
            अस्थायी.setVal('z');
        } else if (प्रथमास्थायी == '1') {
            अस्थायी.setVal('z');
        } else {
            अस्थायी.setVal('z');
        }
        if (!अक्षरत्वपरीक्षा) {
            तृतीयतार्किकाङ्गम्.push_back(अक्षरत्वपरीक्षा);
        } else {
            तृतीयतार्किकाङ्गम्.push_back(अस्थायी.getVal());
        }
    }
    return तृतीयतार्किकाङ्गम्;
}


