#include "json2map.h"

std::string घटकनामस्वीकरणम् (कुञ्जीमूल्यरूपम् प्रकरणसूची, int क्रमः) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
            return कुञ्जी;
        }
    } else {
        cerr << "At the top, error in ghatakanama";
        exit(1);
        
    }
    return "";
}

कुञ्जीमूल्यरूपम्*  घटकसूचकस्वीकरणम् (कुञ्जीमूल्यरूपम् प्रकरणसूची, int क्रमः) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
            return मूल्यम्.स्थानधारकः.get();
        }
    } else {
        cerr << "At the top, error in ghatakasoochi";
        exit(1);
        
    }
    return nullptr;
}