#include "json2verif.h"

void कार्यक्रमनिर्माणम् (कुञ्जीमूल्यरूपम्& प्रकरणसूची, std::string& घटकनाम, std::string& सञ्चिकापाठ) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    
    सञ्चिकापाठ = "#include \"primitive_cpp/definitions.h\"\n";
    सञ्चिकापाठ = सञ्चिकापाठ + "#include<iostream>\n";
    सञ्चिकापाठ = सञ्चिकापाठ + "using namespace std;\n";
    सञ्चिकापाठ = सञ्चिकापाठ + "class " + घटकनाम + "{\n";
    सञ्चिकापाठ = सञ्चिकापाठ + "\tpublic:\n";
    std::string आरम्भकम् = "";
    मूलघटकक्रमनिर्माणम् ( *द्विरुक्तप्रकरणसूची);
    द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    //प्रारम्भकफलनम् (आरम्भकम्, प्रकरणसूची, घटकनाम);
    std::string आद्यारम्भाङ्गम् = "";
    आद्यारम्भाङ्गखण्डपरिचयः(आद्यारम्भाङ्गम्, *द्विरुक्तप्रकरणसूची, घटकनाम, सञ्चिकापाठ);
    द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    सञ्चिकापाठ = सञ्चिकापाठ + आरम्भकम्;
    सञ्चिकापाठ = सञ्चिकापाठ + आद्यारम्भाङ्गम्;
    सदारम्भाङ्गखण्डपरिचयः( *द्विरुक्तप्रकरणसूची);
    द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
                                    std::ofstream सञ्चिका_1("temp2.json");
                                प्रवेशः ("पूर्णघटकः", सञ्चिका_1 , *द्विरुक्तप्रकरणसूची);
    सञ्चिकापाठ = सञ्चिकापाठ + "};\n";
}





void पश्चव्यञ्जकरूपान्तरणम् (std::string& मूल्यम्,std::string& व्यञ्जकम्) {
    std::stack<std::string> स्तूपः;
    std::stringstream प्रवाहः(मूल्यम्);
    std::string अस्थायी;
    std::vector<std::string> प्रतीकाः;

    // The >> operator extracts strings separated by whitespace
    while (प्रवाहः >> अस्थायी) {
        प्रतीकाः.push_back(अस्थायी);
    }


    for (const std::string& प्रतीकः : प्रतीकाः) {
        if (!is_operator(प्रतीकः)) {
            स्तूपः.push(प्रतीकः);
        } else {
            std::string द्वितीयाङ्गम् = स्तूपः.top();
            स्तूपः.pop();
            std::string प्रथमाङ्गम् = स्तूपः.top(); 
            स्तूपः.pop();
            // Wrap in parentheses to maintain order of operations
            if (प्रतीकः == "=") {
                स्तूपः.push("नियोजनम्(&" + प्रथमाङ्गम् + "," +द्वितीयाङ्गम् + ")");
            } else {
                cerr << "To handle this operator " << प्रतीकः << endl;
            }
        }
    }
    if (स्तूपः.size() == 1) {
        व्यञ्जकम् = स्तूपः.top() + ";\n";
    } else {
        cerr << "Error in postfix expression " << मूल्यम्;
        exit(1);
    }

}


