#include "json2verif.h"


void विलम्बफलनम्(कुञ्जीमूल्यरूपम्& प्रकरणसूची, int& विलम्बम्) {
    int प्रथमक्रमः = 0;
    std::string मूल्यम्;
    bool प्राप्तम् = false;
    std::string कुञ्जी;
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                कुञ्जी = कुञ्जी_1; 
                मूल्यम् = मूल्यम्_1;
                उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                if (कुञ्जी == "विलम्बः") {
                    उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                    विलम्बम् = std::stoi(मूल्यम्);
                    प्राप्तम् = true;
                }
            }
        }
        if (प्राप्तम्) {
            break;
        }
        प्रथमक्रमः++;
    }    
}

