#include "json2verif.h"

void मूलघटकक्रमनिर्माणम् (कुञ्जीमूल्यरूपम्& प्रकरणसूची) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int प्रथमक्रमः = 0;
    int द्वितीयक्रमः = 0;    
    bool प्राप्तम्;
    std::string कुञ्जी;
    std::string मूल्यम्;
    std::string नाम;
    while (प्रथमक्रमः < प्रकरणसूची.size()) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&प्रकरणसूची[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                नाम = कुञ्जी_1;
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
            }
            द्वितीयक्रमः = 0;
            प्राप्तम् = false;
            उद्धरणचिह्ननिष्कासनम्(नाम);
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1;
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        if (कुञ्जी == "प्रकारः" &&  मूल्यम् == "तारः") {
                            प्राप्तम् = true;
                        }
                    }
                }
                if (प्राप्तम्) {
                    उद्धरणचिह्ननिष्कासनम्(नाम);
                    break;
                }
                द्वितीयक्रमः++;
            }
            if (कुञ्जी == "प्रकारः" &&  मूल्यम् == "तारः") {
                if (शब्दतत्त्वप्राप्तिः(*द्विरुक्तप्रकरणसूची,"द्वारम्") == "सत्यम्") {
                    if (शब्दतत्त्वप्राप्तिः(*द्विरुक्तप्रकरणसूची,"दिशा") == "प्रवेशः") {
                        द्वितीयक्रमः = 0;
                        while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                            if(शब्दाङ्कनक्शा* आन्तरिकनक्शा = std::get_if<शब्दाङ्कनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                                for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                                    कुञ्जी = कुञ्जी_1;
                                    उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                                }
                                if (कुञ्जी == "क्रमः") {
                                    (*आन्तरिकनक्शा)["\"क्रमः\""] = 1;
                                    break;
                                }
                            }
                            द्वितीयक्रमः++;
                        }
                    }
                }
            }
        }
        प्रथमक्रमः++;
    }    
}

std::string शब्दतत्त्वप्राप्तिः (कुञ्जीमूल्यरूपम्& प्रकरणसूची, std::string कुञ्जी) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int प्रथमक्रमः = 0;
    int द्वितीयक्रमः = 0;    
    std::string कुञ्जी_2;
    std::string मूल्यम्;
    bool प्राप्तम् = false;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                मूल्यम् = मूल्यम्_1;
                कुञ्जी_2 = कुञ्जी_1;
                उद्धरणचिह्ननिष्कासनम्(कुञ्जी_2);
                उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
            }
        }
        if (कुञ्जी_2 == कुञ्जी) {
            return मूल्यम्;
        }
        प्रथमक्रमः++;
    }
    return "";
}


