#include "json2verif.h"


void यद्यङ्गफलनम्(कुञ्जीमूल्यरूपम्& प्रकरणसूची,std::string& सञ्चिकापाठ, std::string आद्यारम्भाङ्गनामम्, std::string घटकनाम, std::vector<शब्दशब्दनक्शा>& यद्यङ्गसूची,int& क्रमः, int वर्तमानाद्याङ्गम्) {
    //यद्यङ्गसूची.clear();
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int प्रथमक्रमः = 0;
    int यद्यङ्गक्रमः = क्रमः;
    std::unordered_map<int,int> यद्यङ्गक्रमसंग्रहः ;
    आद्यारम्भाङ्गक्रमसंग्रहफलनम् (*द्विरुक्तप्रकरणसूची, यद्यङ्गक्रमसंग्रहः );
    द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int द्वितीयक्रमः = 0;
unsigned long अवस्थाचरण = 0;
    int विलम्बम्;
    std::string कुञ्जी;
    std::string मूल्यम्;
    bool प्राप्तम्;
    क्रमः++;
    std::string आद्यारम्भाङ्गयद्यङ्गनामम् = आद्यारम्भाङ्गनामम्+"_"+std::to_string(यद्यङ्गक्रमः); 
    सञ्चिकापाठ = सञ्चिकापाठ +"\tint आगामिनिष्पादनक्रमः_"+आद्यारम्भाङ्गयद्यङ्गनामम् + ";\n";
    सञ्चिकापाठ = सञ्चिकापाठ +"\tint निष्पादनक्रमः_"+आद्यारम्भाङ्गयद्यङ्गनामम् + ";\n";
    सञ्चिकापाठ = सञ्चिकापाठ +"\tbool समाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "=false;\n";
    सञ्चिकापाठ = सञ्चिकापाठ + "\tint निर्णययद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "=0;\n";
    सञ्चिकापाठ = सञ्चिकापाठ +"\tbool समाप्तवर्तमानयद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "=false;\n";   
    std::string यद्यङ्गवाक्यम् = "\tbool "+ घटकनाम + "_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "() {\n";
    यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\tswitch (निष्पादनक्रमः_" + आद्यारम्भाङ्गयद्यङ्गनामम् + ") {\n";
    यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + " : \n";
    प्राप्तम् = false;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                कुञ्जी = कुञ्जी_1; 
                मूल्यम् = मूल्यम्_1;
                उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                if (कुञ्जी == "शर्तिः") {
                    उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                    शब्दशब्दनक्शा नक्शा;
                    नक्शा[आद्यारम्भाङ्गनामम्+"_"+std::to_string(यद्यङ्गक्रमः)] = मूल्यम्;
                    यद्यङ्गसूची.push_back(नक्शा);
                    प्राप्तम् = true;
                }
            }
        }
        if (प्राप्तम्) {
            break;
        }
        प्रथमक्रमः++;
    }
    while (यद्यङ्गक्रमसंग्रहः.size() > 0) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[यद्यङ्गक्रमसंग्रहः[क्रमः]])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {    
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
                कुञ्जी = कुञ्जी_1;
            }
            
            प्राप्तम् = false;
            द्वितीयक्रमः = 0;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1; 
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        if (कुञ्जी == "प्रकारः") {
                            प्राप्तम् = true;
                            if (मूल्यम् == "वाक्यम्") {
                                आद्याङ्गवाक्यम्(*द्विरुक्तप्रकरणसूची, यद्यङ्गवाक्यम्, अवस्थाचरण, आद्यारम्भाङ्गयद्यङ्गनामम्, वर्तमानाद्याङ्गम्, सञ्चिकापाठ, प्रकरणसूची);
                                यद्यङ्गक्रमसंग्रहः.erase(क्रमः);

                                क्रमः++;
                            } else if (मूल्यम् == "समापनम्") {
                                अवस्थाचरण++;
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "++\n";
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + ":\n";
                                यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t\texit(1);\n";
                                यद्यङ्गक्रमसंग्रहः.erase(क्रमः);
                                क्रमः++;
                            } else if (मूल्यम् == "विलम्बाङ्गम्") {
                                विलम्बम्=0;
                                विलम्बफलनम्(*द्विरुक्तप्रकरणसूची,विलम्बम्);
                                यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\tआगामिनिष्पादनक्रमः_" + आद्यारम्भाङ्गयद्यङ्गनामम् + " = वर्तमानकालः+" + std::to_string(विलम्बम्) + ";\n";
                                अवस्थाचरण++;
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + ":\n\t\tif (वर्तमानकालः == आगामिनिष्पादनक्रमः_" + std::to_string(वर्तमानाद्याङ्गम्) +") निष्पादनक्रमः_";
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गयद्यङ्गनामम् +"++;\n";
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\telse break;\n";
                                अवस्थाचरण++;
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + "++\n";
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\tcase " + std::to_string(अवस्थाचरण) +":\n";
                                यद्यङ्गक्रमसंग्रहः.erase(क्रमः);
                                क्रमः++;
                            } else if (मूल्यम् == "अन्यथायद्यङ्गम्") {
                                यद्यङ्गक्रमसंग्रहः.erase(क्रमः);
                                अन्यथायद्यङ्गफलनम्(*द्विरुक्तप्रकरणसूची, सञ्चिकापाठ, आद्यारम्भाङ्गयद्यङ्गनामम्, घटकनाम, यद्यङ्गसूची,क्रमः,वर्तमानाद्याङ्गम्);
                            } else if (मूल्यम् == "अन्यथाङ्गम्") {
                                यद्यङ्गक्रमसंग्रहः.erase(क्रमः);
                                अन्यथाङ्गफलनम्(*द्विरुक्तप्रकरणसूची, सञ्चिकापाठ, आद्यारम्भाङ्गयद्यङ्गनामम्, घटकनाम, यद्यङ्गसूची,क्रमः,वर्तमानाद्याङ्गम्);
                            } else if (मूल्यम् == "यद्यङ्गम्") {
                                std::vector<std::unordered_map<std::string,std::string>> यद्यङ्गसूची_1{};
                                शब्दशब्दनक्शा नक्शा;
                                नक्शा[""] = "";
                                यद्यङ्गसूची_1.push_back(नक्शा);
                                यद्यङ्गक्रमसंग्रहः.erase(क्रमः);
                                
                                यद्यङ्गफलनम्(*द्विरुक्तप्रकरणसूची,सञ्चिकापाठ,आद्यारम्भाङ्गयद्यङ्गनामम्,घटकनाम, यद्यङ्गसूची_1,क्रमः, वर्तमानाद्याङ्गम्);
                                if (यद्यङ्गसूची_1.size() <2) {
                                    cerr << "error in yadyanga soochi size\n";
                                    exit(1);
                                }
                                यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम्+ "\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "=false;\n";
                                if (यद्यङ्गसूची_1.size()>1) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची_1[1]) {
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम्+ "\t\t\tif(" + मूल्यम्_1  + ") {\n";
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\t\tनिर्णययद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + " = 1 ;\n";
                                        //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t}\n";
                                    }
                                }
                                for (int क=2; क < यद्यङ्गसूची_1.size(); क++) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची_1[क]) {
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम्+ "\t\t\t} else if(" +  मूल्यम्_1 + ") {\n";
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\t\tनिर्णययद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + " = " + std::to_string(क) + ";\n";
                                        //यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t}\n";
                                    }                                    
                                }
                                for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची_1[0]) {
                                    if (कुञ्जी_1 != "") {
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम्+ "\t\t\t} else {\n";
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\t\tनिर्णययद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + " = 0;\n";
                                        //यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t}\n";
                                    } 
                                }
                                यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t\t}\n";
                                अवस्थाचरण++;
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "++\n";
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) +":\n";
                                if (यद्यङ्गसूची_1.size()>1) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची_1[1]) {
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम्+ "\t\t\tif(निर्णययद्यङ्गम्_" +  आद्यारम्भाङ्गयद्यङ्गनामम् + "== 1) {\n";
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + " = " + कुञ्जी_1 + "();\n";
                                        //यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t}\n";
                                    }
                                }    
                                for (int क=2; क < यद्यङ्गसूची_1.size(); क++) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची_1[क]) {
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम्+ "\t\t\t} else if(निर्णययद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "==" + std::to_string(क)+ ") {\n";
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + " = " + कुञ्जी_1 + "();\n";
                                        //यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t}\n";
                                    }
                                    
                                }
                                for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची_1[0]) {
                                    if (कुञ्जी_1 != "") {
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम्+ "\t\t\t} else {\n";
                                        यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + "\t\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + " = " + कुञ्जी_1 + "();\n";
                                        //यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t}\n";
                                    } 
                                }
                                यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t\t}\n";
                                यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t\tif (!समाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + ") break;\n";
                                //यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् + यद्यङ्गवाक्यम्;
                                अवस्थाचरण++;
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "++\n";
                                यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + ":\n";
                                
                            } else {
                                cerr << " To be handled for " << मूल्यम्;
                                exit(1);
                            }
                        }  
                    }
                }
                if (प्राप्तम्) {
                    break;
                }  
                द्वितीयक्रमः++;
            }
            
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        
        
    }
    अवस्थाचरण++;
    यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "++\n";
    यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + ":\n";
    यद्यङ्गवाक्यम्  = यद्यङ्गवाक्यम् + "\t\t\tसमाप्तवर्तमानयद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् + "=true;\n";
    यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\t}\n";
    यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t\treturn समाप्तवर्तमानयद्यङ्गम्_" + आद्यारम्भाङ्गयद्यङ्गनामम् +";\n";
    यद्यङ्गवाक्यम् = यद्यङ्गवाक्यम् +"\t}\n";
    सञ्चिकापाठ = सञ्चिकापाठ + यद्यङ्गवाक्यम्;
}