#include "json2verif.h"

void आद्यारम्भाङ्गखण्डपरिचयः (std::string& आद्यारम्भाङ्गम् ,कुञ्जीमूल्यरूपम्& प्रकरणसूची, std::string& घटकनाम, std::string& सञ्चिकापाठ) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int प्रथमक्रमः = 0;
    int द्वितीयक्रमः = 0;
    int तृतीयक्रमः = 0;
    std::string नाम;
    bool प्राप्तम्;
    std::string कुञ्जी;
    std::string मूल्यम्;
    unsigned long वाक्यक्रमः ;
    unsigned long मूल्यम्_2;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                नाम = कुञ्जी_1;
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
            }
            द्वितीयक्रमः = 0;
            प्राप्तम् = false;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1;
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        if (कुञ्जी == "प्रकारः" &&  मूल्यम् == "आद्यारम्भाङ्गम्") {
                            प्राप्तम् = true;
                        }
                    }
                }
                if (प्राप्तम्) {
                    उद्धरणचिह्ननिष्कासनम्(नाम);
                    तृतीयक्रमः = 0;
                    while (तृतीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                        if(शब्दाङ्कनक्शा* आन्तरिकनक्शा = std::get_if<शब्दाङ्कनक्शा>(&(*द्विरुक्तप्रकरणसूची)[तृतीयक्रमः])) {
                            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                                कुञ्जी = कुञ्जी_1;
                                मूल्यम्_2 = मूल्यम्_1;
                                उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                                
                                if (कुञ्जी == "क्रमः" ) {
                                    वाक्यक्रमः = मूल्यम्_2;
                                    break;
                                }
                            }
                        }
                        तृतीयक्रमः++;
                    }
                    आद्यारम्भाङ्गफलनम् (आद्यारम्भाङ्गम्, *द्विरुक्तप्रकरणसूची, घटकनाम, नाम, सञ्चिकापाठ,वाक्यक्रमः, प्रकरणसूची);
                    break;
                }
                द्वितीयक्रमः++;
            }
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        प्रथमक्रमः++;
    }
    
}

void प्रारम्भकफलनम् (std::string& आरम्भकम्,कुञ्जीमूल्यरूपम्& प्रकरणसूची, std::string& घटकनाम) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    //आरम्भकम् =  आरम्भकम् + "\t"+घटकनाम +"() {\n";
    int प्रथमक्रमः = 0;
    int द्वितीयक्रमः = 0;
    std::string नाम;
    bool प्राप्तम्;
    std::string कुञ्जी;
    std::string मूल्यम्;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                नाम = कुञ्जी_1;
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
            }
            द्वितीयक्रमः = 0;
            प्राप्तम् = false;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1;
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        if (कुञ्जी == "प्रकारः" &&  मूल्यम् == "तारः") {
                            प्राप्तम् = true;
                        }
                    }
                }
                if (प्राप्तम्) {
                    उद्धरणचिह्ननिष्कासनम्(नाम);
                    आरम्भकम् =  आरम्भकम् + "\twire "+नाम+";\n";
                    break;
                }
                द्वितीयक्रमः++;
            }
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        प्रथमक्रमः++;
    }
    //आरम्भकम् =  आरम्भकम् +"\t}\n";
}

void आद्यारम्भाङ्गक्रमसंग्रहफलनम् (कुञ्जीमूल्यरूपम्& प्रकरणसूची,std::unordered_map<int,int>& आद्यारम्भाङ्गक्रमसंग्रहः) {
    int प्रथमक्रमः = 0;
    std::string कुञ्जी;
    int मूल्यम्;
    int द्वितीयक्रमः;
    bool प्राप्तम्;
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
            }
            द्वितीयक्रमः = 0;
            प्राप्तम् = false;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दाङ्कनक्शा* आन्तरिकनक्शा = std::get_if<शब्दाङ्कनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1;
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        if (कुञ्जी == "क्रमः") {
                            आद्यारम्भाङ्गक्रमसंग्रहः[मूल्यम्] =  प्रथमक्रमः;
                            प्राप्तम् = true;
                        }
                    }
                }
                if ( प्राप्तम् ) {
                    break;
                }
                द्वितीयक्रमः++;
            }
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        प्रथमक्रमः++;
    }
}

void आद्यारम्भाङ्गफलनम् (std::string& आद्यारम्भाङ्गम् ,कुञ्जीमूल्यरूपम्& प्रकरणसूची, std::string घटकनाम, std::string आद्यारम्भाङ्गनामम्, std::string& सञ्चिकापाठ, unsigned long वाक्यक्रमः, कुञ्जीमूल्यरूपम्& घटकप्रकरणसूची) {
    std::unordered_map<int,int> आद्यारम्भाङ्गक्रमसंग्रहः;
    int वर्तमानाद्याङ्गम् = वाक्यक्रमः;
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    आद्यारम्भाङ्गक्रमसंग्रहफलनम् (*द्विरुक्तप्रकरणसूची, आद्यारम्भाङ्गक्रमसंग्रहः);
    द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int प्रथमक्रमः = 0;
    int क्रमः;
    int विलम्बम्=0;
    std::string मूल्यम्;
    std::string कुञ्जी;
    int द्वितीयक्रमः;
    int मूल्यम्_2;
    bool प्राप्तम् = false;   
    सञ्चिकापाठ = सञ्चिकापाठ +"\tint आगामिनिष्पादनक्रमः_"+आद्यारम्भाङ्गनामम् +";\n";
    सञ्चिकापाठ = सञ्चिकापाठ +"\tint निष्पादनक्रमः_"+आद्यारम्भाङ्गनामम् +";\n";
    सञ्चिकापाठ = सञ्चिकापाठ +"\tbool समाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + "=false;\n";
    सञ्चिकापाठ = सञ्चिकापाठ + "\tint निर्णययद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + "=0;\n";
    आद्यारम्भाङ्गम् = "\tvoid "  + घटकनाम + "_" +आद्यारम्भाङ्गनामम् +"() {\n";
    unsigned long अवस्थाचरण = 0;
    आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\tswitch (निष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + ") {\n";
    आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + " : \n";
    प्रथमक्रमः = 0;
    
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दाङ्कनक्शा* आन्तरिकनक्शा = std::get_if<शब्दाङ्कनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                कुञ्जी = कुञ्जी_1; 
                मूल्यम्_2 = मूल्यम्_1;
                उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                if (कुञ्जी == "क्रमः") {
                    क्रमः = मूल्यम्_2;
                    प्राप्तम् = true;
                }
            }
        }
        if (प्राप्तम्) {
            break;
        }
        प्रथमक्रमः++;
    }
    प्राप्तम् = false;
    क्रमः++;
    प्रथमक्रमः = 0;    
    while (आद्यारम्भाङ्गक्रमसंग्रहः.size() > 0) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[आद्यारम्भाङ्गक्रमसंग्रहः[क्रमः]])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {    
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
            }
            प्राप्तम् = false;
            द्वितीयक्रमः = 0;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1; 
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        
                        if (कुञ्जी == "प्रकारः") {
                            प्राप्तम् = true;
                            if (मूल्यम् == "वाक्यम्") {
                                आद्याङ्गवाक्यम्(*द्विरुक्तप्रकरणसूची, आद्यारम्भाङ्गम्, अवस्थाचरण, आद्यारम्भाङ्गनामम्, वर्तमानाद्याङ्गम्, सञ्चिकापाठ, घटकप्रकरणसूची);
                                आद्यारम्भाङ्गक्रमसंग्रहः.erase(क्रमः);

                                क्रमः++;
                            } else if (मूल्यम् == "समापनम्") {
                                अवस्थाचरण++;
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + "++\n";
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + ":\n";                               
                                आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t\texit(1);\n";
                                आद्यारम्भाङ्गक्रमसंग्रहः.erase(क्रमः);
                                क्रमः++;
                            } else if (मूल्यम् == "विलम्बाङ्गम्") {
                                विलम्बम्=0;
                                विलम्बफलनम्(*द्विरुक्तप्रकरणसूची,विलम्बम्);
                                आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\tआगामिनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + " = वर्तमानकालः+" + std::to_string(विलम्बम्) + ";\n";
                                अवस्थाचरण++;
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + "++\n";
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + ":\n\t\t\tif (वर्तमानकालः == आगामिनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् +") निष्पादनक्रमः_";
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + आद्यारम्भाङ्गनामम् + "++;\n";आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\telse break;\n";
                                अवस्थाचरण++;
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + "++\n";
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) +":\n";
                                आद्यारम्भाङ्गक्रमसंग्रहः.erase(क्रमः);
                                क्रमः++;
                            } else if (मूल्यम् == "यद्यङ्गम्") {
                                std::vector<शब्दशब्दनक्शा> यद्यङ्गसूची{};
                                शब्दशब्दनक्शा नक्शा;
                                नक्शा[""] = "";
                                यद्यङ्गसूची.push_back(नक्शा);
                                
                                आद्यारम्भाङ्गक्रमसंग्रहः.erase(क्रमः);
                                यद्यङ्गफलनम्(*द्विरुक्तप्रकरणसूची, सञ्चिकापाठ, आद्यारम्भाङ्गनामम्, घटकनाम, यद्यङ्गसूची,क्रमः,वर्तमानाद्याङ्गम्);
                                
                                if (यद्यङ्गसूची.size() <2) {
                                    cerr << "error in yadyanga soochi size\n";
                                    exit(1);
                                }
                                आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम्+ "\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + "=false;\n";
                                if (यद्यङ्गसूची.size()>1) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची[1]) {
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम्+ "\t\t\tif(" + मूल्यम्_1  + ") {\n";
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\t\tनिर्णययद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + " = 1 ;\n";
                                        //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t}\n";
                                    }
                                }
                                for (int क=2; क < यद्यङ्गसूची.size(); क++) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची[क]) {
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम्+ "\t\t\t} else if(" + मूल्यम्_1  + ") {\n";
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\t\tनिर्णययद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + " = " + std::to_string(क) + ";\n";
                                        //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t}\n";
                                    }                                    
                                }
                                for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची[0]) {
                                    if (कुञ्जी_1 != "") {
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम्+ "\t\t\t} else {\n";
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\tनिर्णययद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + " = 0;\n";
                                        //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t}\n";
                                    } 
                                }
                                आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t\t}\n";
                                अवस्थाचरण++;
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + "++\n";
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) +":\n";
                                if (यद्यङ्गसूची.size()>1) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची[1]) {
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम्+ "\t\t\tif(निर्णययद्यङ्गम्_" +  आद्यारम्भाङ्गनामम् + "== 1) {\n";
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + " = " + कुञ्जी_1 + "();\n";
                                        //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t}\n";
                                    }
                                }     
                                for (int क=2; क < यद्यङ्गसूची.size(); क++) {
                                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची[क]) {
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम्+ "\t\t\t} else if(निर्णययद्यङ्गम्_" +  आद्यारम्भाङ्गनामम् + "==" + std::to_string(क)+ ") {\n";
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + " = " + कुञ्जी_1 + "();\n";
                                        //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t}\n";
                                    }     
                                }
                                for (const auto& [कुञ्जी_1, मूल्यम्_1] : यद्यङ्गसूची[0]) {
                                    if (कुञ्जी_1 != "") {
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम्+ "\t\t\t} else {\n";
                                        आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t\t\tसमाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + " = " + कुञ्जी_1 + "();\n";
                                        //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t}\n";
                                    } 
                                }
                                आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t\t}\n";
                                आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् +"\t\t\tif (!समाप्त्यद्यङ्गम्_" + आद्यारम्भाङ्गनामम् + ") break;\n";
                                //आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + यद्यङ्गवाक्यम्;
                                अवस्थाचरण++;
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tनिष्पादनक्रमः_" + आद्यारम्भाङ्गनामम् + "++\n";
                                आद्यारम्भाङ्गम्  = आद्यारम्भाङ्गम् + "\t\t\tcase " + std::to_string(अवस्थाचरण) + ":\n";
                                
                            } else {
                                cerr << " To be handled for " << मूल्यम्;
                                exit(1);
                            }
                        }  
                    }
                }
                if (प्राप्तम्) {
                    break;
                }  
                द्वितीयक्रमः++;
            }
            
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        
        
    }
    आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t\t}\n";
    आद्यारम्भाङ्गम् = आद्यारम्भाङ्गम् + "\t}\n";
}
