#include "json2verif.h"

void सदारम्भाङ्गखण्डपरिचयः (कुञ्जीमूल्यरूपम्& प्रकरणसूची) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    कुञ्जीमूल्यरूपम्* त्रिरुक्तप्रकरणसूची;
    कुञ्जीमूल्यरूपम्* चतुरुक्तप्रकरणसूची;
    int प्रथमक्रमः = 0;
    int द्वितीयक्रमः = 0;
    int तृतीयक्रमः = 0;
    std::string नाम;
    bool प्राप्तम्;
    std::string कुञ्जी;
    std::string मूल्यम्;
    std::vector<std::string> सदारम्भचर;
    unsigned long वाक्यक्रमः ;
    unsigned long मूल्यम्_2;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                नाम = कुञ्जी_1;
                उद्धरणचिह्ननिष्कासनम्(नाम);
                चतुरुक्तप्रकरणसूची = द्विरुक्तप्रकरणसूची;
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
            }
            द्वितीयक्रमः = 0;
            प्राप्तम् = false;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1;
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        if (कुञ्जी == "प्रकारः" &&  मूल्यम् == "सदाङ्गम्") {
                            त्रिरुक्तप्रकरणसूची = द्विरुक्तप्रकरणसूची;
                            सदारम्भचर = सदारम्भचरस्वीकरणम्(*त्रिरुक्तप्रकरणसूची);
                            for (const auto& चर : सदारम्भचर) {
                                पिण्डः प्रथमपिण्डः;
                                प्रथमपिण्डः.स्थानधारकः=std::make_shared<कुञ्जीमूल्यरूपम्>();
                                शब्दपिण्डनक्शा नक्शा;
                                नक्शा[चर+"_"+नाम] = प्रथमपिण्डः;
                                कुञ्जीमूल्यरूपम्* अस्थायिद्विरुक्तप्रकरणसूची = प्रथमपिण्डः.स्थानधारकः.get();
                                त्रिरुक्तप्रकरणसूची = द्विरुक्तप्रकरणसूची;
                                सदारम्भाङ्गफलनम् ( *त्रिरुक्तप्रकरणसूची, *अस्थायिद्विरुक्तप्रकरणसूची, चर);
                                चतुरुक्तप्रकरणसूची->push_back(नक्शा);

                            }                        
                        }
                    }
                }

                द्वितीयक्रमः++;
            }
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        त्रिरुक्तप्रकरणसूची = &प्रकरणसूची;
        प्रथमक्रमः++;
    }
}

void सदारम्भाङ्गफलनम् (कुञ्जीमूल्यरूपम्& प्रकरणसूची, कुञ्जीमूल्यरूपम्& अस्थायिप्रकरणसूची, std::string चर) {
    std::stack<int> क्रमस्तूपः = std::stack<int>();
    std::stack<int> अस्थायिक्रमस्तूपः = std::stack<int>();
    std::stack<int>परिमाणस्तूपः = std::stack<int>();    
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    std::string कुञ्जी_1;
    std::string मूल्यम्_1;
    कुञ्जीमूल्यरूपम्* अस्थायिद्विरुक्तप्रकरणसूची = &अस्थायिप्रकरणसूची;
    परिमाणस्तूपः.push(द्विरुक्तप्रकरणसूची->size());
    int क्रमः = 0;
    while (!परिमाणस्तूपः.empty()) {
        // Accessing map by index
        if (शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
                कुञ्जी_1 = कुञ्जी;
                मूल्यम्_1 = मूल्यम्;
                उद्धरणचिह्ननिष्कासनम्(कुञ्जी_1);
                उद्धरणचिह्ननिष्कासनम्(मूल्यम्_1);
                if (कुञ्जी_1 == "प्रकारः" && मूल्यम्_1 == "सदाङ्गम्") {
                    string मूल्यम्_2 = "\"नवसदाङ्गम्\"";
                    शब्दशब्दनक्शा अस्थायिनक्शा;
                    अस्थायिनक्शा[कुञ्जी] = मूल्यम्_2;
                    अस्थायिद्विरुक्तप्रकरणसूची->push_back(अस्थायिनक्शा);
                    शब्दशब्दनक्शा अस्थायिनक्शा1;
                    अस्थायिनक्शा1["\"फलचर\""] = "\""+चर+"\"";
                    अस्थायिद्विरुक्तप्रकरणसूची->push_back(अस्थायिनक्शा1);
                } else {
                    अस्थायिद्विरुक्तप्रकरणसूची->push_back(*आन्तरिकनक्शा);
                }
            }
        }else if (शब्दाङ्कनक्शा* आन्तरिकनक्शा = std::get_if<शब्दाङ्कनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            अस्थायिद्विरुक्तप्रकरणसूची->push_back(*आन्तरिकनक्शा);
        } else if (अङ्कसूचिनक्शा* आन्तरिकनक्शा = std::get_if<अङ्कसूचिनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            अस्थायिद्विरुक्तप्रकरणसूची->push_back(*आन्तरिकनक्शा);
        } else if (शब्दसूचिनक्शा* आन्तरिकनक्शा = std::get_if<शब्दसूचिनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            अस्थायिद्विरुक्तप्रकरणसूची->push_back(*आन्तरिकनक्शा);
        } else if (शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            क्रमस्तूपः.push(क्रमः);
            क्रमः = -1;
            for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
                पिण्डः प्रथमपिण्डः;
                प्रथमपिण्डः.स्थानधारकः=std::make_shared<कुञ्जीमूल्यरूपम्>();
                शब्दपिण्डनक्शा नक्शा;
                नक्शा[कुञ्जी] = प्रथमपिण्डः;
                अस्थायिक्रमस्तूपः.push(अस्थायिद्विरुक्तप्रकरणसूची->size());
                अस्थायिद्विरुक्तप्रकरणसूची->push_back(नक्शा);
                अस्थायिद्विरुक्तप्रकरणसूची = प्रथमपिण्डः.स्थानधारकः.get();
                द्विरुक्तप्रकरणसूची = मूल्यम्.स्थानधारकः.get();
                परिमाणस्तूपः.push(द्विरुक्तप्रकरणसूची->size());
            }
        } else {
            cerr << "New type of array; To be handled" << endl;
        }
        while (क्रमः == परिमाणस्तूपः.top()-1) {
            परिमाणस्तूपः.pop();    
            if (!क्रमस्तूपः.empty()) {
                क्रमः = क्रमस्तूपः.top();
                क्रमस्तूपः.pop();
            }
            if (!अस्थायिक्रमस्तूपः.empty()) {
                अस्थायिक्रमस्तूपः.pop();
            }
            if (क्रमस्तूपः.empty()) {
                द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
            } else {
                द्विरुक्तप्रकरणसूची = सूचकपर्यन्तसञ्चरणम् ( क्रमस्तूपः, प्रकरणसूची);
            }  
            if (अस्थायिक्रमस्तूपः.empty()) {
                अस्थायिद्विरुक्तप्रकरणसूची = &अस्थायिप्रकरणसूची;
            } else {
                अस्थायिद्विरुक्तप्रकरणसूची = सूचकपर्यन्तसञ्चरणम् ( अस्थायिक्रमस्तूपः, अस्थायिप्रकरणसूची);            
            }                      
            if (द्विरुक्तप्रकरणसूची == nullptr ) {
                cerr << "Error from soochakaparyanta: dwirukta" << endl;
            }
            if (अस्थायिद्विरुक्तप्रकरणसूची == nullptr ) {
                cerr << "Error from soochakaparyanta: asthayi" << endl;
            }
            if (परिमाणस्तूपः.empty()) {
                break;
            }
        }
        क्रमः++;
    }
    द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    अस्थायिद्विरुक्तप्रकरणसूची = &अस्थायिप्रकरणसूची;
    अनिष्टवाक्यनिर्मूलनम्(*अस्थायिद्विरुक्तप्रकरणसूची, चर); 
    अस्थायिद्विरुक्तप्रकरणसूची = &अस्थायिप्रकरणसूची;
    std::string आश्रितचर = आश्रितचरग्रहणम् (*अस्थायिद्विरुक्तप्रकरणसूची);
    अस्थायिद्विरुक्तप्रकरणसूची = &अस्थायिप्रकरणसूची;
    आश्रितचरमुद्रणम् (*अस्थायिद्विरुक्तप्रकरणसूची, आश्रितचर);
    
    द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
}


std::vector<std::string> सदारम्भचरस्वीकरणम् ( कुञ्जीमूल्यरूपम्& प्रकरणसूची) {
    std::stack<int> क्रमस्तूपः = std::stack<int>();
    std::stack<int>परिमाणस्तूपः = std::stack<int>();
    std::vector<std::string> सदारम्भचर = std::vector<std::string>();
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    परिमाणस्तूपः.push(द्विरुक्तप्रकरणसूची->size());
    int क्रमः = 0;
    while (!परिमाणस्तूपः.empty()) {
        // Accessing map by index
        if (शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
                std::string कुञ्जी_1 = कुञ्जी;
                उद्धरणचिह्ननिष्कासनम्(कुञ्जी_1);
                if (कुञ्जी_1 == "वाक्यम्") {
                    std::string मूल्यम्_1 = मूल्यम्;
                    उद्धरणचिह्ननिष्कासनम्(मूल्यम्_1);
                    सदारम्भचर.push_back( नियुक्तचरस्वीकरणम्(मूल्यम्_1));
                }                
            }
        }else if (शब्दाङ्कनक्शा* आन्तरिकनक्शा = std::get_if<शब्दाङ्कनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        } else if (अङ्कसूचिनक्शा* आन्तरिकनक्शा = std::get_if<अङ्कसूचिनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        } else if (शब्दसूचिनक्शा* आन्तरिकनक्शा = std::get_if<शब्दसूचिनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        } else if (शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            क्रमस्तूपः.push(क्रमः);
            क्रमः = -1;
            for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
                
                द्विरुक्तप्रकरणसूची = मूल्यम्.स्थानधारकः.get();
                परिमाणस्तूपः.push(द्विरुक्तप्रकरणसूची->size());
            }
        } else {
            cerr << "From update always begin: "<< क्रमः <<" New type of array; To be handled" << endl;
        }
        while (क्रमः == परिमाणस्तूपः.top()-1) {
            परिमाणस्तूपः.pop();    
            if (!क्रमस्तूपः.empty()) {
                क्रमः = क्रमस्तूपः.top();
                क्रमस्तूपः.pop();
            }            
            if (क्रमस्तूपः.empty()) {
                द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
            } else {
                द्विरुक्तप्रकरणसूची = सूचकपर्यन्तसञ्चरणम्(क्रमस्तूपः, प्रकरणसूची);
                if (द्विरुक्तप्रकरणसूची == nullptr) {
                    cerr << "Error from soochakaparyanta";
                }
            }            
            if (परिमाणस्तूपः.empty()) {
                break;
            }
        }
        क्रमः++;
    }
    चरपुनरावृत्तिनिवारणम्(सदारम्भचर);
    return सदारम्भचर;
}

std::string नियुक्तचरस्वीकरणम् (std::string मूल्यम्) {
    std::string सदारम्भचर = "";
    for (int क = 0; क < मूल्यम्.length(); क++) {
        if (मूल्यम्[क] != ' ') {
            सदारम्भचर += मूल्यम्[क];
        } else  {
            break;
        }
    }
    return सदारम्भचर;
}

void चरपुनरावृत्तिनिवारणम् (std::vector<std::string>& शब्दनक्शा) {
    std::vector<std::string> शब्दनक्शाफलम्;
    std::unordered_set<std::string> पुनरावृत्तिशब्दनक्शा;
    for (const std::string& न : शब्दनक्शा) {
        if (पुनरावृत्तिशब्दनक्शा.find(न) == पुनरावृत्तिशब्दनक्शा.end()) {
            शब्दनक्शाफलम्.push_back(न);
            पुनरावृत्तिशब्दनक्शा.insert(न);
        }
    }
    शब्दनक्शा = std::move(शब्दनक्शाफलम्);
}

void अनिष्टवाक्यनिर्मूलनम्(कुञ्जीमूल्यरूपम्& प्रकरणसूची, std::string चर) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int प्रथमक्रमः = 0;
    int द्वितीयक्रमः = 0;
    std::string कुञ्जी;
    std::string मूल्यम्; 
    std::string name;
    unsigned long वाक्यक्रमः ;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();
                name = कुञ्जी_1;
            }
            द्वितीयक्रमः = 0;
            bool प्राप्तम् = false;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1;
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        if (कुञ्जी == "वाक्यम्") {
                            if (चर != नियुक्तचरस्वीकरणम्( मूल्यम्)) {
                                प्राप्तम् = true;
                            }
                        }
                    }
                }
                if (प्राप्तम्) {
                    द्विरुक्तप्रकरणसूची->erase(द्विरुक्तप्रकरणसूची->begin() + प्रथमक्रमः);
                    प्रथमक्रमः--;
                    break;
                } else {
                    द्वितीयक्रमः++;
                }
            }
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        प्रथमक्रमः++;
    }
                                
}

std::string आश्रितचरग्रहणम् (कुञ्जीमूल्यरूपम्& प्रकरणसूची) {
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    int प्रथमक्रमः = 0;
    int द्वितीयक्रमः = 0;
    std::string कुञ्जी;
    std::string मूल्यम्; 
    std::string चर;
    unsigned long वाक्यक्रमः ;
    while (प्रथमक्रमः < द्विरुक्तप्रकरणसूची->size()) {
        if(शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[प्रथमक्रमः])) {
            for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                द्विरुक्तप्रकरणसूची = मूल्यम्_1.स्थानधारकः.get();

            }
            द्वितीयक्रमः = 0;
            while (द्वितीयक्रमः < द्विरुक्तप्रकरणसूची->size()) {
                if(शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[द्वितीयक्रमः])) {
                    for (const auto& [कुञ्जी_1, मूल्यम्_1] : *आन्तरिकनक्शा) {
                        कुञ्जी = कुञ्जी_1;
                        मूल्यम् = मूल्यम्_1;
                        उद्धरणचिह्ननिष्कासनम्(कुञ्जी);
                        उद्धरणचिह्ननिष्कासनम्(मूल्यम्);
                        if (कुञ्जी == "वाक्यम्") {
                            चर = चर +" " +सर्वचरग्रहणम्( मूल्यम्);
                        }
                    }
                }
                द्वितीयक्रमः++;
            }
        }
        द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
        प्रथमक्रमः++;
    }
    return  चर;                          
}

std::string सर्वचरग्रहणम् (std::string मूल्यम्) {
    std::string सदारम्भचर = "";
    for (int क = 0; क < मूल्यम्.length(); क++) {
        if (मूल्यम्[क] != ' ') {
            सदारम्भचर = सदारम्भचर + " " + मूल्यम्[क];
        }
    }
    return सदारम्भचर;
}

void आश्रितचरमुद्रणम् (कुञ्जीमूल्यरूपम्& प्रकरणसूची, std::string चर) {
    std::stack<int> क्रमस्तूपः = std::stack<int>();
    std::stack<int>परिमाणस्तूपः = std::stack<int>();    
    कुञ्जीमूल्यरूपम्* द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
    std::string कुञ्जी_1;
    std::string मूल्यम्_1;
    परिमाणस्तूपः.push(द्विरुक्तप्रकरणसूची->size());
    int क्रमः = 0;
    bool प्राप्तम् =false;
    while (!परिमाणस्तूपः.empty()) {
        // Accessing map by index
        if (शब्दशब्दनक्शा* आन्तरिकनक्शा = std::get_if<शब्दशब्दनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
                कुञ्जी_1 = कुञ्जी;
                मूल्यम्_1 = मूल्यम्;
                उद्धरणचिह्ननिष्कासनम्(कुञ्जी_1);
                उद्धरणचिह्ननिष्कासनम्(मूल्यम्_1);
                cout << कुञ्जी_1 << " " << मूल्यम्_1 <<endl;
                if (कुञ्जी_1 == "प्रकारः" && मूल्यम्_1 == "नवसदाङ्गम्") {
                    string कुञ्जी_2 = "\"आश्रितचर\"";
                    शब्दशब्दनक्शा अस्थायिनक्शा;
                    अस्थायिनक्शा[कुञ्जी_2] ="\""+चर+"\"";
                    द्विरुक्तप्रकरणसूची->push_back(अस्थायिनक्शा);
                    प्राप्तम् = true;
                } 
            }
        }else if (शब्दाङ्कनक्शा* आन्तरिकनक्शा = std::get_if<शब्दाङ्कनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        } else if (अङ्कसूचिनक्शा* आन्तरिकनक्शा = std::get_if<अङ्कसूचिनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        } else if (शब्दसूचिनक्शा* आन्तरिकनक्शा = std::get_if<शब्दसूचिनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
        } else if (शब्दपिण्डनक्शा* आन्तरिकनक्शा = std::get_if<शब्दपिण्डनक्शा>(&(*द्विरुक्तप्रकरणसूची)[क्रमः])) {
            क्रमस्तूपः.push(क्रमः);
            क्रमः = -1;
            for (const auto& [कुञ्जी, मूल्यम्] : *आन्तरिकनक्शा) {
                पिण्डः प्रथमपिण्डः;
                प्रथमपिण्डः.स्थानधारकः=std::make_shared<कुञ्जीमूल्यरूपम्>();
                द्विरुक्तप्रकरणसूची = मूल्यम्.स्थानधारकः.get();
                परिमाणस्तूपः.push(द्विरुक्तप्रकरणसूची->size());
            }
        } else {
            cerr << "New type of array; To be handled" << endl;
        }
        while (क्रमः == परिमाणस्तूपः.top()-1) {
            परिमाणस्तूपः.pop();    
            if (!क्रमस्तूपः.empty()) {
                क्रमः = क्रमस्तूपः.top();
                क्रमस्तूपः.pop();
            }            
            if (क्रमस्तूपः.empty()) {
                द्विरुक्तप्रकरणसूची = &प्रकरणसूची;
            } else {
                द्विरुक्तप्रकरणसूची = सूचकपर्यन्तसञ्चरणम्(क्रमस्तूपः, प्रकरणसूची);
                if (द्विरुक्तप्रकरणसूची == nullptr) {
                    cerr << "Error from soochakaparyanta";
                }
            }
            if (परिमाणस्तूपः.empty()) {
                break;
            }
        }
        if ( प्राप्तम्) {
            break;
        }
        क्रमः++;
    }
}